session2/OF6-session2/unsteady/caseicoFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)//0
    (8 0 0)//1
    (8 1 0)//2
    (0 1 0)//3
    (0 0 2)//4
    (8 0 2)//5
    (8 1 2)//6
    (0 1 2)//7

    (8 0.5 0)//8
    (16 0.5 0)//9
    (16 1 0)//2
    (8 1 0)//3
    (8 0.5 2)//4
    (16 0.5 2)//5
    (16 1 2)//6
    (8 1 2)//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 60 1) simpleGrading (0.2 1 1)
    hex (8 9 10 11 12 13 14 15) (50 30 1) simpleGrading (5 5 1)

);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9 10 14 13)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
	    (10 11 15 14)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
	    (8 9 13 12)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
	    (12 13 14 15)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
	    (8 11 10 9)
        );
    }

    large
    {
        type symmetryPlane;
        faces
        (
            (5 1 2 6)
        );
    }

    small
    {
        type symmetryPlane;
        faces
        (
            (8 11 15 12)
        );
    }
);

mergePatchPairs
(
	(large small)//(master patch     slave patch)
);

// ************************************************************************* //
